chengy2/goodix_hdsc_spi/hc32f46x_ddl_Rev1.1.1/example/spi/spi_fp_app/source/misc.c
        DMA_SetTransferCnt(USART_TX_DMA_UNIT, USART_TX_DMA_CH, len);
        DMA_ChannelCmd(USART_TX_DMA_UNIT, USART_TX_DMA_CH, Enable);

        /*Enable TX interupt function*/
        USART_FuncCmd(USART_UNIT, UsartTxAndTxEmptyInt, Enable);
    }
    //else
    //{
    //    enRet = ErrorInvalidParameter;
    //}

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Callback function for DP wakeup
 ** \param  None
 ** \retval None
 ******************************************************************************/
//void USB_DP_ExintCallback(void)
//{
//    /* add your code here */
//    HAL_NVIC_DisableIRQ(DP_INT_IRQn);
//    EXINT_IrqFlgClr(DP_EXINT_CH);
//}

/**
 *******************************************************************************
 ** \brief  Callback function for DM wakeup
 ** \param  None
 ** \retval None
 ******************************************************************************/
//void USB_DM_ExintCallback(void)
//{
//    /* add your code here */
//    HAL_NVIC_DisableIRQ(DM_INT_IRQn);
//    EXINT_IrqFlgClr(DM_EXINT_CH);
//}

/**
 *******************************************************************************
 ** \brief  Callback function for EC exint
 ** \param  None
 ** \retval None
 ******************************************************************************/
void EC_ExintCallback(void)
{
    /* add your code here */
    EXINT_IrqFlgClr(EC_EXINT_CH);
}

/**
 *******************************************************************************
 ** \brief  Callback function for FP exint
 ** \param  None
 ** \retval None
 ******************************************************************************/
void FP_ExintCallback(void)
{
    /* add your code here */
    EXINT_IrqFlgClr(FP_EXINT_CH);
}

/**
 *******************************************************************************
 ** \brief  Exint configure for DP DM wakeup from stop mode
 ** \param  None
 ** \retval None
 ** \note   Call before enter stop mode
 ******************************************************************************/
//void USB_DPDMWakeupConfig(void)
//{
//    stc_exint_config_t stcExtiConfig;
//    stc_irq_regi_conf_t stcIrqRegiConf;
//    stc_port_init_t stcPortInit;
//
//    /* GPIO input and exint enable */
//    MEM_ZERO_STRUCT(stcPortInit);
//    stcPortInit.enPinMode = Pin_Mode_In;
//    stcPortInit.enExInt = Enable;
//    PORT_Init(DP_PORT, DP_PIN, &stcPortInit);  /* DP */
//    PORT_Init(DM_PORT, DM_PIN, &stcPortInit);  /* DM */
//
//    /* Exint config */
//    stcExtiConfig.enExitCh = DP_EXINT_CH;
//    stcExtiConfig.enFilterEn = Enable;
//    stcExtiConfig.enFltClk = Pclk3Div8;
//    stcExtiConfig.enExtiLvl = ExIntBothEdge;
//    EXINT_Init(&stcExtiConfig);
//    stcExtiConfig.enExitCh = DM_EXINT_CH;
//    EXINT_Init(&stcExtiConfig);
//
//    /* Select External Int Ch.12 */
//    stcIrqRegiConf.enIntSrc = DP_INT_SRC;
//    stcIrqRegiConf.enIRQn = DP_INT_IRQn;
//    stcIrqRegiConf.pfnCallback = &USB_DP_ExintCallback;
//    enIrqRegistration(&stcIrqRegiConf);
////    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
////    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_15);
////    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
//    HAL_NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
//    HAL_NVIC_SetPriority(stcIrqRegiConf.enIRQn, 1, 0);
//    HAL_NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
//
//    /* Select External Int Ch.11 */
//    stcIrqRegiConf.enIntSrc = DM_INT_SRC;
//    stcIrqRegiConf.enIRQn = DM_INT_IRQn;
//    stcIrqRegiConf.pfnCallback = &USB_DM_ExintCallback;
//    enIrqRegistration(&stcIrqRegiConf);
////    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
////    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_15);
////    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
//    HAL_NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
//    HAL_NVIC_SetPriority(stcIrqRegiConf.enIRQn, 1, 0);
//    HAL_NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
//
//    /* Enbale exint ch11 and ch12 wakeup from stop mode */
//    enIntWakeupEnable(Extint12WU | Extint11WU);
//}

/**
 *******************************************************************************
 ** \brief  Exint configure for DP DM wakeup from stop mode
 ** \param  None
 ** \retval None
 ** \note   Call after wakeup from stop mode
 ******************************************************************************/
//void USB_DPDM_PortInit(void)
//{
//    stc_port_init_t stcPortInit;
//
//    MEM_ZERO_STRUCT(stcPortInit);
//    stcPortInit.enPinMode = Pin_Mode_Ana;
//    PORT_Init(DP_PORT, DP_PIN, &stcPortInit);
//    PORT_Init(DM_PORT, DM_PIN, &stcPortInit);
//
//    /* un-gate USB Core clock */
//    USB_OTG_EnableUSBCoreClock(&USB_OTG_dev);
//}

/**
 *******************************************************************************
 ** \brief  Exint configure for EC pin
 ** \param  None
 ** \retval None
 ******************************************************************************/
void EcIntConfig(void)
{
    stc_exint_config_t stcExtiConfig;
    stc_irq_regi_conf_t stcIrqRegiConf;
    stc_port_init_t stcPortInit;

    /* GPIO input and exint enable */
    MEM_ZERO_STRUCT(stcPortInit);
    stcPortInit.enPinMode = Pin_Mode_In;
    stcPortInit.enExInt = Enable;
    PORT_Init(EC_PORT, EC_PIN, &stcPortInit);

    /* Exint config */
    stcExtiConfig.enExitCh = EC_EXINT_CH;
    stcExtiConfig.enFilterEn = Enable;
    stcExtiConfig.enFltClk = Pclk3Div8;
    stcExtiConfig.enExtiLvl = ExIntBothEdge;  /* Rising and falling edge */
    EXINT_Init(&stcExtiConfig);

    /* Select External Int Ch.11 */
    stcIrqRegiConf.enIntSrc = EC_INT_SRC;
    stcIrqRegiConf.enIRQn = EC_INT_IRQn;
    stcIrqRegiConf.pfnCallback = &EC_ExintCallback;
    enIrqRegistration(&stcIrqRegiConf);
//    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
//    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_15);
//    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
    HAL_NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
    HAL_NVIC_SetPriority(stcIrqRegiConf.enIRQn, 2, 1);
    HAL_NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);

    /* Enable wakeup */
    enIntWakeupEnable(Extint5WU);
}

/**
 *******************************************************************************
 ** \brief  Get EC pin status
 ** \param  None
 ** \retval None
 ******************************************************************************/
uint32_t GetECStatus(void)
{
    return PORT_GetBit(EC_PORT, EC_PIN);
}

/**
 *******************************************************************************
 ** \brief  Exint configure for FP pin
 ** \param  None
 ** \retval None
 ******************************************************************************/
void FPIntConfig(void)
{
    stc_exint_config_t stcExtiConfig;
    stc_irq_regi_conf_t stcIrqRegiConf;
    stc_port_init_t stcPortInit;

