chengy2/goodix_hdsc_spi/hc32f46x_ddl_Rev1.1.1/example/spi/spi_fp_app/source/misc.c
    /* GPIO input and exint enable */
    MEM_ZERO_STRUCT(stcPortInit);
    stcPortInit.enPinMode = Pin_Mode_In;
    stcPortInit.enExInt = Enable;
    PORT_Init(FP_PORT, FP_PIN, &stcPortInit);

    /* Exint config */
    stcExtiConfig.enExitCh = FP_EXINT_CH;
    stcExtiConfig.enFilterEn = Enable;
    stcExtiConfig.enFltClk = Pclk3Div8;
    stcExtiConfig.enExtiLvl = ExIntRisingEdge;  /* Rising edge */
    EXINT_Init(&stcExtiConfig);

    /* Select External Int Ch.11 */
    stcIrqRegiConf.enIntSrc = FP_INT_SRC;
    stcIrqRegiConf.enIRQn = FP_INT_IRQn;
    stcIrqRegiConf.pfnCallback = &FP_ExintCallback;
    enIrqRegistration(&stcIrqRegiConf);
//    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
//    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_15);
//    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
    HAL_NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
    HAL_NVIC_SetPriority(stcIrqRegiConf.enIRQn, 2, 0);
    HAL_NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);

    /* Enable wakeup */
    enIntWakeupEnable(Extint0WU);
}

uint8_t u8TestRev = 0;
uint8_t u8TestTrans = 0;

void USART_TxCmplt(void)
{
    u8TestTrans = 1;

    USART_FuncCmd(USART_UNIT, UsartTxAndTxEmptyInt, Disable);
    DMA_ClearIrqFlag(USART_TX_DMA_UNIT, USART_TX_DMA_CH, TrnCpltIrq);
    DMA_ClearIrqFlag(USART_TX_DMA_UNIT, USART_TX_DMA_CH, BlkTrnCpltIrq);
}

void USART_RxCmplt(void)
{
    u8TestRev = 1;

    USART_FuncCmd(USART_UNIT, UsartRx, Disable);
    DMA_ClearIrqFlag(USART_RX_DMA_UNIT, USART_RX_DMA_CH, TrnCpltIrq);
    DMA_ClearIrqFlag(USART_RX_DMA_UNIT, USART_RX_DMA_CH, BlkTrnCpltIrq);
}

/**
 *******************************************************************************
 ** \brief  Stop mode config for power consumption
 ** \param  None
 ** \retval None
 ******************************************************************************/
void StopModeConfig(void)
{
    stc_pwc_stop_mode_cfg_t stcPwcStopCfg;
    MEM_ZERO_STRUCT(stcPwcStopCfg);
    stcPwcStopCfg.enStpDrvAbi = StopUlowspeed;
    stcPwcStopCfg.enStopClk = ClkFix;
    stcPwcStopCfg.enStopFlash = Wait;
    stcPwcStopCfg.enPll = Enable;

    PWC_StopModeCfg(&stcPwcStopCfg);
}

static void UsartDmaInit(void)
{
    stc_irq_regi_conf_t stcIrqRegiConf;
    stc_dma_config_t stcDmaCfg;

    /* configuration structure initialization */
    MEM_ZERO_STRUCT(stcDmaCfg);

    PWC_Fcg0PeriphClockCmd(PWC_FCG0_PERIPH_AOS | PWC_FCG0_PERIPH_DMA2, Enable);

    DMA_ClearIrqFlag(USART_TX_DMA_UNIT, USART_TX_DMA_CH, TrnCpltIrq);
    DMA_ClearIrqFlag(USART_TX_DMA_UNIT, USART_TX_DMA_CH, BlkTrnCpltIrq);
    DMA_ClearIrqFlag(USART_RX_DMA_UNIT, USART_RX_DMA_CH, TrnCpltIrq);
    DMA_ClearIrqFlag(USART_RX_DMA_UNIT, USART_RX_DMA_CH, BlkTrnCpltIrq);
    DMA_DeInit(USART_TX_DMA_UNIT, USART_TX_DMA_CH);
    DMA_DeInit(USART_TX_DMA_UNIT, USART_RX_DMA_CH);

    /* Configure TX DMA */
    stcDmaCfg.u16BlockSize = 1u;
    //stcDmaCfg.u16TransferCnt = u16BufferLen;
    //stcDmaCfg.u32SrcAddr = NULL;
    stcDmaCfg.u32DesAddr = (uint32_t)&USART_UNIT->DR;
    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressIncrease;
    stcDmaCfg.stcDmaChCfg.enDesInc = AddressFix;
    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma8Bit;
    stcDmaCfg.stcDmaChCfg.enIntEn = Enable;
    DMA_InitChannel(USART_TX_DMA_UNIT, USART_TX_DMA_CH, &stcDmaCfg);

    /* Configure RX DMA */
    stcDmaCfg.u16BlockSize = 1u;
    //stcDmaCfg.u16TransferCnt = u16BufferLen;
    stcDmaCfg.u32SrcAddr = ((uint32_t)(&USART_UNIT->DR)+2ul);
    //stcDmaCfg.u32DesAddr = NULL;
    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressFix;
    stcDmaCfg.stcDmaChCfg.enDesInc = AddressIncrease;
    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma8Bit;
    stcDmaCfg.stcDmaChCfg.enIntEn = Enable;
    DMA_InitChannel(USART_RX_DMA_UNIT, USART_RX_DMA_CH, &stcDmaCfg);

    DMA_SetTriggerSrc(USART_TX_DMA_UNIT, USART_TX_DMA_CH, USART_TX_DMA_TRG_SEL);
    DMA_SetTriggerSrc(USART_RX_DMA_UNIT, USART_RX_DMA_CH, USART_RX_DMA_TRG_SEL);

    /* interrupt */
    stcIrqRegiConf.enIntSrc = TX_DMA_BTC_INT_NUM;
    stcIrqRegiConf.enIRQn = TX_DMA_BTC_INT_IRQn;
    stcIrqRegiConf.pfnCallback = &USART_TxCmplt;
    enIrqRegistration(&stcIrqRegiConf);
    DMA_EnableIrq(USART_TX_DMA_UNIT, USART_TX_DMA_CH, TrnCpltIrq);

    stcIrqRegiConf.enIntSrc = RX_DMA_BTC_INT_NUM;
    stcIrqRegiConf.enIRQn = RX_DMA_BTC_INT_IRQn;
    stcIrqRegiConf.pfnCallback = &USART_RxCmplt;
    enIrqRegistration(&stcIrqRegiConf);
    DMA_EnableIrq(USART_RX_DMA_UNIT, USART_RX_DMA_CH, TrnCpltIrq);

    HAL_NVIC_SetPriority(TX_DMA_BTC_INT_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(TX_DMA_BTC_INT_IRQn);

    HAL_NVIC_SetPriority(RX_DMA_BTC_INT_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(RX_DMA_BTC_INT_IRQn);

    DMA_Cmd(USART_TX_DMA_UNIT, Enable);
    DMA_Cmd(USART_RX_DMA_UNIT, Enable);
}

/**
 *******************************************************************************
 ** \brief USART RX error irq callback function.
 **
 ** \param [in] None
 **
 ** \retval None
 **
 ******************************************************************************/
static void UsartErrIrqCallback(void)
{
    //m_enTestResult = Error;

    if (Set == USART_GetStatus(USART_UNIT, UsartFrameErr))
    {
        USART_ClearStatus(USART_UNIT, UsartFrameErr);
    }
    else
    {
    }

    if (Set == USART_GetStatus(USART_UNIT, UsartParityErr))
    {
        USART_ClearStatus(USART_UNIT, UsartParityErr);
    }
    else
    {
    }

    if (Set == USART_GetStatus(USART_UNIT, UsartOverrunErr))
    {
        USART_ClearStatus(USART_UNIT, UsartOverrunErr);
    }
    else
    {
    }
}

/**
 *******************************************************************************
 ** \brief  SPI slave init(USART)
 ** \param  None
 ** \retval None
 ******************************************************************************/
void SlaveSpiInit(void)
{
    stc_irq_regi_conf_t stcIrqRegiCfg;
    const stc_usart_clksync_init_t stcInitCfg = {
        UsartExtClk,
        UsartClkDiv_1,
        UsartDataMsbFirst,
        UsartRtsEnable,
    };

    USART_DeInit(USART_UNIT);
    UsartDmaInit();

     /* Enable peripheral clock */
    PWC_Fcg1PeriphClockCmd(USART_UNIT_CLOCK, Enable);
    /* Initialize USART IO */
    PORT_DebugPortSetting(TDO_SWO, Disable);
    PORT_DebugPortSetting(TRST, Disable);
    PORT_SetFunc(USART_CK_PORT, USART_CK_PIN, USART_CK_FUNC, Disable);
    PORT_SetFunc(USART_RX_PORT, USART_RX_PIN, USART_RX_FUNC, Disable);
    PORT_SetFunc(USART_TX_PORT, USART_TX_PIN, USART_TX_FUNC, Disable);

    /* Initialize USART */
    USART_CLKSYNC_Init(USART_UNIT, &stcInitCfg);
    //USART_SetBaudrate(USART_UNIT, USART_BAUDRATE);

