chengy2/goodix_hdsc_spi/hc32f46x_ddl_Rev1.1.1/example/spi/spi_fp_app/source/misc.c
    /* Set USART RX error IRQ */
    stcIrqRegiCfg.enIRQn = USART_EI_IRQn;
    stcIrqRegiCfg.pfnCallback = &UsartErrIrqCallback;
    stcIrqRegiCfg.enIntSrc = USART_EI_NUM;
    enIrqRegistration(&stcIrqRegiCfg);
    NVIC_SetPriority(stcIrqRegiCfg.enIRQn, DDL_IRQ_PRIORITY_DEFAULT);
    NVIC_ClearPendingIRQ(stcIrqRegiCfg.enIRQn);
    NVIC_EnableIRQ(stcIrqRegiCfg.enIRQn);

    /* Clear communnication error status */
    if (Set == USART_GetStatus(USART_UNIT, UsartOverrunErr))
    {
        USART_ClearStatus(USART_UNIT, UsartOverrunErr);
    }
    USART_RecData(USART_UNIT);
}

/**
 *******************************************************************************
 ** \brief  SPI slave de-init(USART)
 ** \param  None
 ** \retval None
 ******************************************************************************/
void SlaveSpiDeInit(void)
{
    USART_DeInit(USART_UNIT);

    PORT_SetFunc(USART_CK_PORT, USART_CK_PIN, Func_Gpio, Disable);
    PORT_SetFunc(USART_RX_PORT, USART_RX_PIN, Func_Gpio, Disable);
    PORT_SetFunc(USART_TX_PORT, USART_TX_PIN, Func_Gpio, Disable);

    DMA_DeInit(USART_TX_DMA_UNIT, USART_TX_DMA_CH);
    DMA_DeInit(USART_TX_DMA_UNIT, USART_RX_DMA_CH);

    HAL_NVIC_DisableIRQ(USART_EI_IRQn);
    HAL_NVIC_DisableIRQ(TX_DMA_BTC_INT_IRQn);
    HAL_NVIC_DisableIRQ(RX_DMA_BTC_INT_IRQn);
}

/**
 *******************************************************************************
 ** \brief  MCU_CPU_IRQ pin init
 ** \param  None
 ** \retval None
 ******************************************************************************/
void MCU_CPU_IRQ_PinInit(void)
{
    stc_port_init_t stcPortInit;

    /* configuration structure initialization */
    MEM_ZERO_STRUCT(stcPortInit);

    stcPortInit.enPinMode = Pin_Mode_Out;
    PORT_Init(MCU_CPU_IRQ_PORT, MCU_CPU_IRQ_PIN, &stcPortInit);
}

/**
 *******************************************************************************
 ** \brief  Callback function for USART RX exint
 ** \param  None
 ** \retval None
 ******************************************************************************/
void USART_RX_ExintCallback(void)
{
    /* add your code here */
    EXINT_IrqFlgClr(USART_RX_EXINT_CH);
}

/**
 *******************************************************************************
 ** \brief  Exint configure for USART RX pin
 ** \param  None
 ** \retval None
 ******************************************************************************/
void USART_RX_IntConfig(void)
{
    stc_exint_config_t stcExtiConfig;
    stc_irq_regi_conf_t stcIrqRegiConf;
    stc_port_init_t stcPortInit;

    /* GPIO input and exint enable */
    MEM_ZERO_STRUCT(stcPortInit);
    stcPortInit.enPinMode = Pin_Mode_In;
    stcPortInit.enExInt = Enable;
    PORT_Init(USART_RX_PORT, USART_RX_PIN, &stcPortInit);

    /* Exint config */
    stcExtiConfig.enExitCh = USART_RX_EXINT_CH;
    stcExtiConfig.enFilterEn = Enable;
    stcExtiConfig.enFltClk = Pclk3Div8;
    stcExtiConfig.enExtiLvl = ExIntRisingEdge;  /* Rising edge */
    EXINT_Init(&stcExtiConfig);

    /* Select External Int Ch.11 */
    stcIrqRegiConf.enIntSrc = USART_RX_INT_SRC;
    stcIrqRegiConf.enIRQn = USART_RX_INT_IRQn;
    stcIrqRegiConf.pfnCallback = &USART_RX_ExintCallback;
    enIrqRegistration(&stcIrqRegiConf);

    HAL_NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
    HAL_NVIC_SetPriority(stcIrqRegiConf.enIRQn, 2, 0);
    HAL_NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);

    /* Enable wakeup */
    enIntWakeupEnable(Extint3WU);
}

void RandInit(void)
{
    stc_trng_init_t stcTrngInit;
    /* TRGN clock config */
    CLK_SetPeriClkSource(ClkPeriSrcPclk);

    stcTrngInit.enLoadCtrl   = TrngLoadNewInitValue_Enable;
    stcTrngInit.enShiftCount = TrngShiftCount_64;

    /* 1. Enable TRNG. */
    PWC_Fcg0PeriphClockCmd(PWC_FCG0_PERIPH_TRNG, Enable);
    /* 2. Initialize TRNG. */
    TRNG_Init(&stcTrngInit);
}

/* Software delay about 10mS */
#define TIMEOUT_DELAY (SystemCoreClock/100ul)
uint32_t FlashRandGenerate(void)
{
    uint32_t u32DataRead = 0ul;
    /* Start TRNG, check TRNG and get random number. */
    if(Ok != TRNG_Generate(&u32DataRead, 1u, TIMEOUT_DELAY))
    {
        u32DataRead = 0xFFFFFFFFul;
    }

    return u32DataRead;
}

void RandStop(void)
{
    /* 1. De-init TRNG */
    TRNG_DeInit();
    /* 2. Disable TRNG. */
    PWC_Fcg0PeriphClockCmd(PWC_FCG0_PERIPH_TRNG, Disable);
}

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
